<a href="https://colab.research.google.com/github/Kevoen/Google_Colab_Rep/blob/master/%E7%AC%AC%E4%B8%80%E7%AB%A0%E7%AC%AC%E4%B8%89%E8%8A%82%EF%BC%9A%E6%8E%A2%E7%B4%A2%E6%80%A7%E6%95%B0%E6%8D%AE%E5%88%86%E6%9E%90_%E8%AF%BE%E7%A8%8B.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 0. 链接与挂载Google Drive

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [3]:
!ln -s /content/drive/My\ Drive /mydrive

In [4]:
%cd /mydrive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合

**复习：**在前面我们已经学习了Pandas基础，知道利用Pandas读取csv数据的增删查改，今天我们要学习的就是**探索性数据分析**，主要介绍如何利用Pandas进行排序、算术计算以及计算描述函数describe()的使用。

# 1 第一章：探索性数据分析

#### 开始之前，导入numpy、pandas包和数据

In [5]:
#加载所需的库
import numpy as np
import pandas as pd

In [26]:
#载入之前保存的train_chinese.csv数据，关于泰坦尼克号的任务，我们就使用这个数据
df = pd.read_csv('train_chinese.csv')
df.head(3)

   乘客ID  是否幸存  乘客等级  ...       票价   客舱  登船港口
0     1     0     3  ...   7.2500  NaN     S
1     2     1     1  ...  71.2833  C85     C
2     3     1     3  ...   7.9250  NaN     S

[3 rows x 12 columns]

### 1.6 了解你的数据吗？
教材《Python for Data Analysis》第五章

#### 1.6.1 任务一：利用Pandas对示例数据进行排序，要求升序

In [15]:
# 具体请看《利用Python进行数据分析》第五章 排序和排名 部分

#自己构建一个都为数字的DataFrame数据

d = {'2': [1., 2., 3., 4.],'1': [4., 3., 2., 1.],'3': [5., 23., 28., 30.]}
frame = pd.DataFrame(d, index=['a', 'c', 'd', 'b'])
frame.head()

     2    1     3
a  1.0  4.0   5.0
c  2.0  3.0  23.0
d  3.0  2.0  28.0
b  4.0  1.0  30.0

【代码解析】

pd.DataFrame() ：创建一个DataFrame对象 

np.arange(8).reshape((2, 4)) : 生成一个二维数组（2*4）,第一列：0，1，2，3 第二列：4，5，6，7

index=['2, 1] ：DataFrame 对象的索引列

columns=['d', 'a', 'b', 'c'] ：DataFrame 对象的索引行

【问题】：大多数时候我们都是想根据列的值来排序,所以将你构建的DataFrame中的数据根据某一列，升序排列

In [17]:
#回答代码
frame.sort_values(by='1',ascending=False)

     2    1     3
a  1.0  4.0   5.0
c  2.0  3.0  23.0
d  3.0  2.0  28.0
b  4.0  1.0  30.0

【思考】通过书本你能说出Pandas对DataFrame数据的其他排序方式吗？

【总结】下面将不同的排序方式做一个总结

1.让行索引升序排序

In [20]:
#代码
frame.sort_index()

     2    1     3
a  1.0  4.0   5.0
b  4.0  1.0  30.0
c  2.0  3.0  23.0
d  3.0  2.0  28.0

2.让列索引升序排序

In [21]:
#代码
frame.sort_index(axis=1)

     1    2     3
a  4.0  1.0   5.0
c  3.0  2.0  23.0
d  2.0  3.0  28.0
b  1.0  4.0  30.0

3.让列索引降序排序

In [22]:
#代码
frame.sort_index(axis=1,ascending=False)

      3    2    1
a   5.0  1.0  4.0
c  23.0  2.0  3.0
d  28.0  3.0  2.0
b  30.0  4.0  1.0

4.让任选两列数据同时降序排序

In [24]:
#代码
frame.sort_values(by=['2','3'])

     2    1     3
a  1.0  4.0   5.0
c  2.0  3.0  23.0
d  3.0  2.0  28.0
b  4.0  1.0  30.0

#### 1.6.2 任务二：对泰坦尼克号数据（trian.csv）按票价和年龄两列进行综合排序（降序排列），从这个数据中你可以分析出什么？

In [ ]:
'''
在开始我们已经导入了train_chinese.csv数据，而且前面我们也学习了导入数据过程，根据上面学习，我们直接对目标列进行排序即可
head(20) : 读取前20条数据

'''

In [29]:
#代码
df.sort_values(by=['票价','年龄'],ascending=False).head(20)

     乘客ID  是否幸存  乘客等级  ...        票价               客舱  登船港口
679   680     1     1  ...  512.3292      B51 B53 B55     C
258   259     1     1  ...  512.3292              NaN     C
737   738     1     1  ...  512.3292             B101     C
438   439     0     1  ...  263.0000      C23 C25 C27     S
341   342     1     1  ...  263.0000      C23 C25 C27     S
88     89     1     1  ...  263.0000      C23 C25 C27     S
27     28     0     1  ...  263.0000      C23 C25 C27     S
742   743     1     1  ...  262.3750  B57 B59 B63 B66     C
311   312     1     1  ...  262.3750  B57 B59 B63 B66     C
299   300     1     1  ...  247.5208          B58 B60     C
118   119     0     1  ...  247.5208          B58 B60     C
380   381     1     1  ...  227.5250              NaN     C
716   717     1     1  ...  227.5250              C45     C
700   701     1     1  ...  227.5250          C62 C64     C
557   558     0     1  ...  227.5250              NaN     C
527   528     0     1  ...  221.7792              C95     S
377   378     0     1  ...  211.5000              C82     C
779   780     1     1  ...  211.3375               B3     S
730   731     1     1  ...  211.3375               B5     S
689   690     1     1  ...  211.3375               B5     S

[20 rows x 12 columns]

【思考】排序后，如果我们仅仅关注年龄和票价两列。根据常识我知道发现票价越高的应该客舱越好，所以我们会明显看出，票价前20的乘客中存活的有14人，这是相当高的一个比例，那么我们后面是不是可以进一步分析一下票价和存活之间的关系，年龄和存活之间的关系呢？当你开始发现数据之间的关系了，数据分析就开始了。

当然，这只是我的想法，你还可以有更多想法，欢迎写在你的学习笔记中。

**多做几个数据的排序**

In [37]:
#代码
df.sort_values(by=['登船港口','票价'],ascending=False).head(20)

     乘客ID  是否幸存  乘客等级  ...        票价           客舱  登船港口
27     28     0     1  ...  263.0000  C23 C25 C27     S
88     89     1     1  ...  263.0000  C23 C25 C27     S
341   342     1     1  ...  263.0000  C23 C25 C27     S
438   439     0     1  ...  263.0000  C23 C25 C27     S
527   528     0     1  ...  221.7792          C95     S
689   690     1     1  ...  211.3375           B5     S
730   731     1     1  ...  211.3375           B5     S
779   780     1     1  ...  211.3375           B3     S
318   319     1     1  ...  164.8667           C7     S
856   857     1     1  ...  164.8667          NaN     S
268   269     1     1  ...  153.4625         C125     S
332   333     0     1  ...  153.4625          C91     S
609   610     1     1  ...  153.4625         C125     S
297   298     0     1  ...  151.5500      C22 C26     S
305   306     1     1  ...  151.5500      C22 C26     S
498   499     0     1  ...  151.5500      C22 C26     S
708   709     1     1  ...  151.5500          NaN     S
269   270     1     1  ...  135.6333          C99     S
334   335     1     1  ...  133.6500          NaN     S
660   661     1     1  ...  133.6500          NaN     S

[20 rows x 12 columns]

In [ ]:
#写下你的思考

#### 1.6.3 任务三：利用Pandas进行算术计算，计算两个DataFrame数据相加结果

In [ ]:
# 具体请看《利用Python进行数据分析》第五章 算术运算与数据对齐 部分

#自己构建两个都为数字的DataFrame数据

"""
我们举了一个例子：
frame1_a = pd.DataFrame(np.arange(9.).reshape(3, 3),
                     columns=['a', 'b', 'c'],
                     index=['one', 'two', 'three'])
frame1_b = pd.DataFrame(np.arange(12.).reshape(4, 3),
                     columns=['a', 'e', 'c'],
                     index=['first', 'one', 'two', 'second'])
frame1_a
"""

In [38]:
#代码
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

将frame_a和frame_b进行相加

In [39]:
#代码
df + df2

          A         B         C   D
0  0.821723 -0.880870 -1.616422 NaN
1  0.883903  0.750880  0.299790 NaN
2 -1.247423 -0.867203  1.388503 NaN
3  0.112501  1.514399 -0.895470 NaN
4 -2.362843 -0.766174  0.335253 NaN
5 -1.359662 -0.056274 -1.370758 NaN
6  2.706016 -0.516001  1.609095 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

【提醒】两个DataFrame相加后，会返回一个新的DataFrame，对应的行和列的值会相加，没有对应的会变成空值NaN。<br>
当然，DataFrame还有很多算术运算，如减法，除法等，有兴趣的同学可以看《利用Python进行数据分析》第五章 算术运算与数据对齐 部分，多在网络上查找相关学习资料。

#### 1.6.4 任务四：通过泰坦尼克号数据如何计算出在船上最大的家族有多少人？

In [ ]:
'''
还是用之前导入的chinese_train.csv如果我们想看看在船上，最大的家族有多少人（‘兄弟姐妹个数’+‘父母子女个数’），我们该怎么做呢？
'''

In [40]:
#代码
df = pd.read_csv('train_chinese.csv')
max(df['堂兄弟/妹个数']+df['父母与小孩个数'])

10

【提醒】我们只需找出”兄弟姐妹个数“和”父母子女个数“之和最大的数，当然你还可以想出很多方法和思考角度，欢迎你来说出你的看法。

**多做几个数据的相加，看看你能分析出什么？**

In [ ]:
#代码

In [ ]:
#写下你的其他分析

#### 1.6.5 任务五：学会使用Pandas describe()函数查看数据基本统计信息

In [ ]:
#(1) 关键知识点示例做一遍（简单数据）
# 具体请看《利用Python进行数据分析》第五章 汇总和计算描述统计 部分

#自己构建一个有数字有空值的DataFrame数据


"""
我们举了一个例子：
frame2 = pd.DataFrame([[1.4, np.nan], 
                       [7.1, -4.5],
                       [np.nan, np.nan], 
                       [0.75, -1.3]
                      ], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
frame2

"""

In [42]:
#代码
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df.head()

          A         B         C         D
0 -1.064467 -0.293272  0.099213  0.840824
1 -0.583205 -0.753020 -0.101719  1.050506
2 -0.414281  0.207704  0.594302  1.189643
3  0.271302  0.112034  0.826177  1.161422
4  0.585331  0.588224 -1.453167 -0.865488

调用 describe 函数，观察frame2的数据基本信息

In [43]:
#代码
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.137529   0.186209   0.070951   0.583349
std     0.885535   0.646151   0.737262   0.749937
min    -1.064467  -0.753020  -1.453167  -0.865488
25%    -0.540974  -0.218773  -0.181305   0.222015
50%     0.246140   0.067494   0.171558   0.788231
75%     0.603816   0.493094   0.594027   1.133693
max     1.714379   1.465138   0.868103   1.376376

#### 1.6.6 任务六：分别看看泰坦尼克号数据集中 票价、父母子女 这列数据的基本统计数据，你能发现什么？

In [ ]:
'''
看看泰坦尼克号数据集中 票价 这列数据的基本统计数据
'''

In [44]:
#代码
df = pd.read_csv('train_chinese.csv')
df['票价'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: 票价, dtype: float64

【思考】从上面数据我们可以看出，试试在下面写出你的看法。然后看看我们给出的答案。

当然，答案只是我的想法，你还可以有更多想法，欢迎写在你的学习笔记中。

**多做几个组数据的统计，看看你能分析出什么？**

In [45]:
# 写下你的其他分析
df['年龄'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: 年龄, dtype: float64

【思考】有更多想法，欢迎写在你的学习笔记中。

【总结】本节中我们通过Pandas的一些内置函数对数据进行了初步统计查看，这个过程最重要的不是大家得掌握这些函数，而是看懂从这些函数出来的数据，构建自己的数据分析思维，这也是第一章最重要的点，希望大家学完第一章能对数据有个基本认识，了解自己在做什么，为什么这么做，后面的章节我们将开始对数据进行清洗，进一步分析。